Definitely an issue - one additional thing to note is that once keys are flagged as deprecated (over 100 versions) by AWS, it takes 24(ish) hours for the keys to actually be removed.  

We experienced the same issue for a secret that rotates itself regularly via a lambda - we use Terraform to instantiate the secret and the initial version, with lifecycle policies similar to @CyrilDevOps above, and after a certain number of rotations combined with a certain amount of time, ANY plan, with or without changes, will determine that the version was deleted and will attempt to recreate the secret (thus overwriting the generated value with the original, and breaking the process until the rotation occurs next).  

```
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.secrets_test.aws_secretsmanager_secret_version.ignore_changes[0] has been deleted
  - resource "aws_secretsmanager_secret_version" "ignore_changes" {
        id             = "arn:aws:secretsmanager:us-east-1:123412341234:secret:TestSecret-ABCxyz|terraform-20240614221415692500000001"
      - version_id     = "terraform-20240614221415692500000001" -> null
        # (4 unchanged attributes hidden)
    }
    
 # module.secrets_test.aws_secretsmanager_secret_version.ignore_changes[0] will be created
  + resource "aws_secretsmanager_secret_version" "ignore_changes" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = "arn:aws:secretsmanager:us-east-1:123412341234:secret:TestSecret-ABCxyz"
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = [
          + "AWSCURRENT",
        ]
    }
```